rjrouquette/gpsdo/msp430/main.c
#include <msp430.h>
#include "config.h"
#include "dcxo.h"
#include "eeram.h"
#include "gps.h"
#include "i2c.h"
#include "math.h"
#include "pid.h"
#include "pps.h"
#include "tcxo.h"

#define TIMER_NS (5) // 5 ns
#define TEMP_PPS_TOL (100) // 100ns
#define PPM_SCALE (0x218DEF41l)

#define TEMP_CSA (0x49u)
#define TEMP_ERR (0x8000)

// internal state
int32_t prevTempComp = TCXO_ERR;
int32_t tempComp = 0;
int32_t pidComp = 0;
int32_t totalComp = 0;

// stat accumulators
int64_t accAvgError = 0;
uint64_t accRmsError = 0;

// normalized stats
int32_t avgError = 0; // 24.8 fixed-point (ns)
int32_t rmsError = 0; // 24.8 fixed-point (ns)
int32_t ppmAdjust = 0; // 16.16 fixed-point (ppm)

void doTrackingUpdate(int16_t ppsDelay);

void TempSens_init();
int16_t TempSens_read();

void SysBoot();
void SysClk();


int main() {
    // bootstrap MCU
    SysBoot();
    I2C_init();
    DCXO_init();
    SysClk();
    _enable_interrupts();

    // init code modules
    EERAM_init();
    SysConf_load();
    PPS_init();
    PID_init();

    // pet watchdog
    WDTCTL |= WDTPW | WDTCNTCL;
    // release watchdog
    WDTCTL = WDTPW | (WDTCTL & 0x7F);

    // main processing loop
    for(;;) {
        // pet watchdog
        WDTCTL |= WDTPW | WDTCNTCL;
        // poll GPS data
        GPS_poll();
        // check for PPS measurement
        int16_t ppsDelay = PPS_poll();
        if(ppsDelay != PPS_IDLE) {
            doTrackingUpdate(ppsDelay);
        }
    }

    return 0;
}

void doTrackingUpdate(int16_t ppsDelay) {
        // TODO get actual temp
        int16_t tempC = TempSens_read();
        uint8_t allowTempUpdate = (tempC != TEMP_ERR);
        if(allowTempUpdate) {
            // adjust precision of temperature measurement 
            tempC <<= 1u;
            // get temperature compensation
            tempComp = TCXO_getCompensation(tempC);
            if(tempComp == TCXO_ERR) {
                if(prevTempComp == TCXO_ERR)
                    tempComp = 0;
                else
                    tempComp = prevTempComp;
            } else {
                if(prevTempComp == TCXO_ERR)
                    PID_clearIntegral();
                prevTempComp = tempComp;
            }
        }

        // update PPS tracking loop
        if(ppsDelay != PPS_NOLOCK) {
            // TODO get actual PPS error
            int32_t ppsError = mult16s16s(ppsDelay, TIMER_NS);
            ppsError += sysConf.ppsErrorOffset;
            // Update PID tracking loop
            pidComp = PID_update(ppsError);
            // Update average error (63s EMA)
            accAvgError -= accAvgError >> 5u;
            accAvgError += ppsError << 16u;
            // Update RMS error (63s EMA)
            accRmsError -= accRmsError >> 5u;
            accRmsError += (uint64_t)mult32s32s(ppsError, ppsError) << 16u;
            // wait for loop to settle before updating temperature compensation
            if(ppsError < -TEMP_PPS_TOL) allowTempUpdate = 0;
            if(ppsError >  TEMP_PPS_TOL) allowTempUpdate = 0;
        } else {
            allowTempUpdate = 0;
        }

        // combine compensation values
        totalComp = pidComp + tempComp;
        // apply frequency adjustment
        DCXO_setOffset(totalComp);

        if(allowTempUpdate) {
            // adjust temperature compensation
            TCXO_updateCompensation(tempC, totalComp);
        }

        // compute normalized dcxo offset in ppm (16.16 fixed-point)
        ppmAdjust = mult32s32s(totalComp, PPM_SCALE) >> 32u;
}

void TempSens_init() {
    // conf bytes
    uint8_t conf[3] = { 0x01, 0x00, 0x60 };
    // configure temp sensor
    I2C_startWrite(TEMP_CSA);
    I2C_write(conf, 3);
    I2C_stop();
}

int16_t TempSens_read() {
    // set register address
    I2C_startWrite(TEMP_CSA);
    I2C_write8(0x00);
    // read measurement
    I2C_startRead(TEMP_CSA);
    int16_t result = I2C_read16b();
    I2C_stop();
    return result;
}

void SysBoot() {
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;
    // Switch FLL reference to REFO
    UCSCTL3 = SELREF__REFOCLK | FLLREFDIV__1;
    // clear pin assignments
    PASEL = 0; PBSEL = 0;
    PADIR = 0; PBDIR = 0;
    PAOUT = 0; PBOUT = 0;
    // enable pull-down on all pins
    PAREN = -1; PBREN = -1;
}

void SysClk() {
    // change XT1 to HF bypass mode
    UCSCTL6 = XT1BYPASS | XTS;
    // select XT1 function on pin
    PJSEL = BIT5;
    // set all dividers to 1
    UCSCTL5 = 0;
    // set ACLK to REFO, other clocks to XT1
    UCSCTL4 = SELA__REFOCLK | SELS__XT1CLK | SELM__XT1CLK;
    // disable DCO and FLL
    __bis_SR_register(SCG0);
    __bis_SR_register(SCG1);
    // set I2C clk to 400 kHz
    I2C_prescaler(6250u);
    // configure watchdog with 1s interval
    WDTCTL = WDTPW | WDTHOLD | WDTSSEL__ACLK | WDTCNTCL | WDTIS__32K;
}
